{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "/media/lurker18/HardDrive/HuggingFace/models/MetaAI/Llama_3_8B_Instruct",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "o_proj",
    "q_proj",
    "k_proj",
<<<<<<<< HEAD:Results/MedQA/Llama3-8B-Instruct/checkpoint-7638/adapter_config.json
    "gate_proj",
    "down_proj",
    "v_proj",
    "up_proj"
========
    "v_proj",
    "up_proj",
    "gate_proj",
    "down_proj"
>>>>>>>> adf0e9c6efb46371f8e83d00f2dad39b1f9552c6:Results/MedQA/Llama3-8B-Instruct/checkpoint-3819/adapter_config.json
  ],
  "task_type": "CAUSAL_LM",
  "use_dora": false,
  "use_rslora": false
}